# ---------------------------1-----------------------------

# ---------------------------Структура
catalog = [
(1, {"название": "компьютер", "цена": 20000, "количество": 5, "ед.": "шт."}),
(2, {"название": "принтер", "цена": 6000, "количество": 2, "ед.": "шт."}),
(3, {"название": "сканер", "цена": 2000, "количество": 7, "ед.": "шт."})
        ]
stat = {}
# ---------------------------Заполнение структуры
for k,v in catalog:
    for key in v:
        pass
        #inp = input(f"Введите {key} товара: ")
        #v[key] = inp

# ---------------------------Сбор статистики
#stat =  dict.fromkeys(v.keys(),[])
# Верхний вариант жутко косячит, почему - не понял.
stat = {'название': [], 'цена': [], 'количество': [], 'ед.': []}
for k,v in catalog:
    for k_ in v:
        stat[k_].append(v[k_])
print(stat)
